RSN/src/DataProcessors/ПродлитьЗаписиРС/ПродлитьЗаписиРС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПродлитьЗаписиРС</name>
</mdclass:DataProcessor>

RSN/src/InformationRegisters/РеестрИДинамикаБД1С/РеестрИДинамикаБД1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеестрИДинамикаБД1С</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </resources>
  <dimensions>
    <name>СерверПриложений</name>
    <type>
      <types>CatalogRef.СерверПриложений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/DataProcessors/ПродлитьЗаписиРС/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	РеестрИДинамикаБД1ССрезПоследних.СерверПриложений КАК СерверПриложений
	               |ИЗ
	               |	РегистрСведений.РеестрИДинамикаБД1С.СрезПоследних КАК РеестрИДинамикаБД1ССрезПоследних
	               |ГДЕ
	               |	РеестрИДинамикаБД1ССрезПоследних.Период < &Период"; 
	Запрос.УстановитьПараметр("Период", ТекущаяДата() - 7 * 24* 60 *60);
	ВЫборка = Запрос.Выполнить().Выбрать();
	Пока ВЫборка.Следующий() Цикл 
		СерверыПриложений.Добавить(Выборка.СерверПриложений);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьЗаписиНаСервере(МассивСП)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрИДинамикаБД1ССрезПоследних.Период КАК Период,
	               |	РеестрИДинамикаБД1ССрезПоследних.СерверПриложений КАК СерверПриложений,
	               |	РеестрИДинамикаБД1ССрезПоследних.ИмяБазы КАК ИмяБазы,
	               |	РеестрИДинамикаБД1ССрезПоследних.ИнформационнаяБаза КАК ИнформационнаяБаза
	               |ИЗ
	               |	РегистрСведений.РеестрИДинамикаБД1С.СрезПоследних(, СерверПриложений В (&Сервера)) КАК РеестрИДинамикаБД1ССрезПоследних";
	Запрос.УстановитьПараметр("Сервера", МассивСП);
	ВЫборка = Запрос.Выполнить().Выбрать();  
	День = 60*60*24;  
	Сегодня = ТекущаяДата() ;
	Пока ВЫборка.Следующий() Цикл  
		ТД = Выборка.Период + День;
		Пока ТД < Сегодня Цикл 
			
			Мз = РегистрыСведений.РеестрИДинамикаБД1С.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Период = ТД;
			Попытка
				Мз.Записать(Истина);
			Исключение
			КонецПопытки;
			
			ТД = ТД + День;
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗаписи(Команда) 
	МассивСП = ОбщегоНазначенияКлиентСервер.ОтмеченныеЭлементы(СерверыПриложений);
	Если ЗначениеЗаполнено(МассивСП) Тогда 
		ЗаполнитьЗаписиНаСервере(МассивСП);
	КонецЕсли;
КонецПроцедуры
